<a href="https://colab.research.google.com/github/HECTOR1810/actividad-1/blob/main/ActividadFormativa_Equipo3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#**Actividad Formativa 1 - Cómputo en la Nube**

###Alejandro Díaz Carrillo A01650603

###Héctor San Román Caraza A01422876

###Brenda Guadalupe Martínez Orta A01570565

###Pedro Alan González Arámbula A01625308

In [ ]:
import pandas as pd
import matplotlib.pyplot as plt

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

###- Importar la base de datos como “data frame”.

In [ ]:
df=pd.read_csv('/content/drive/Shareddrives/Análisis de Ciencia de Datos/Actividad Formativa 1/titanic.csv')

###- Verifica que el archivo cargado en Google Colab corresponde con el archivo csv, revisando los primeros y los últimos renglones del "data frame".

In [ ]:
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
df.tail()

     PassengerId  Survived  Pclass  ...   Fare Cabin  Embarked
886          887         0       2  ...  13.00   NaN         S
887          888         1       1  ...  30.00   B42         S
888          889         0       3  ...  23.45   NaN         S
889          890         1       1  ...  30.00  C148         C
890          891         0       3  ...   7.75   NaN         Q

[5 rows x 12 columns]

###- Identifica cuáles variables son categóricas y cuáles numéricas. Muestra esta información en una celda de texto.

**Variables categóricas**: PassengerId, Survived, Pclass, Name, Sex, Ticket, Cabin, Embarked.

**Variables numéricas**: Age, SibSp, Parch, Fare

###- Revisen qué hace la función columns(), info() y describe(). Expliquen en una celda texto lo que hace cada una de estas funciones y muestren la información generada.

In [ ]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

**df.columns** sirve para conocer el nombre de cada una de las columnas que existen en el dataframe. Los nombres equivalen al encabezado de cada columna.

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

**df.info()** indica el nombre y número de columnas del dataframe, el número de datos que no son nulos de cada una, el tipo de datos que contiene la columna, el uso de memoria.

In [ ]:
df.describe(include='all')

        PassengerId    Survived      Pclass  ...        Fare Cabin  Embarked
count    891.000000  891.000000  891.000000  ...  891.000000   204       889
unique          NaN         NaN         NaN  ...         NaN   147         3
top             NaN         NaN         NaN  ...         NaN    G6         S
freq            NaN         NaN         NaN  ...         NaN     4       644
mean     446.000000    0.383838    2.308642  ...   32.204208   NaN       NaN
std      257.353842    0.486592    0.836071  ...   49.693429   NaN       NaN
min        1.000000    0.000000    1.000000  ...    0.000000   NaN       NaN
25%      223.500000    0.000000    2.000000  ...    7.910400   NaN       NaN
50%      446.000000    0.000000    3.000000  ...   14.454200   NaN       NaN
75%      668.500000    1.000000    3.000000  ...   31.000000   NaN       NaN
max      891.000000    1.000000    3.000000  ...  512.329200   NaN       NaN

[11 rows x 12 columns]

**df.describe()** muestra información estadística de las columnas con datos numéricos, tal como la cuenta, media, desviación estándar, mínimo, máximo, cuartiles. En las columnas con datos categóricos, se muestra el número de datos, el dato más común (top), el número de veces que se repite el dato más común (freq), cuántos datos hay sin contar los repetidos (unique).

###- De las variables categóricas indica cuántos valores diferentes se tiene por categoría. De las variables numéricas indica su valor promedio, mediana, mínimo y máximo.

In [ ]:
# PassengerId - Variable categórica
len(df['PassengerId'].unique())

891

In [ ]:
# Survived - Variable categórica
len(df['Survived'].unique())

2

In [ ]:
# Pclass - Variable categórica
len(df['Pclass'].unique())

3

In [ ]:
# Name - Variable categórica
len(df['Name'].unique())

891

In [ ]:
# Sex - Variable categórica
len(df['Sex'].unique())

2

In [ ]:
# Age - Variable numérica
df['Age'].describe().loc[['mean','min','max']]

mean    29.699118
min      0.420000
max     80.000000
Name: Age, dtype: float64

In [ ]:
df['Age'].median()

28.0

In [ ]:
# SibSp - Variable numérica
df['SibSp'].describe().loc[['mean','min','max']]

mean    0.523008
min     0.000000
max     8.000000
Name: SibSp, dtype: float64

In [ ]:
df['SibSp'].median()

0.0

In [ ]:
# Parch - Variable numérica
df['Parch'].describe().loc[['mean','min','max']]

mean    0.381594
min     0.000000
max     6.000000
Name: Parch, dtype: float64

In [ ]:
df['Parch'].median()

0.0

In [ ]:
# Ticket - Variable categórica
len(df['Ticket'].unique())

681

In [ ]:
# Fare - Variable numérica
df['Fare'].describe().loc[['mean','min','max']]

mean     32.204208
min       0.000000
max     512.329200
Name: Fare, dtype: float64

In [ ]:
df['Fare'].median()

14.4542

In [ ]:
# Cabin - Variable categórica
len(df['Cabin'].unique())

148

In [ ]:
# Embarked - Variable categórica
len(df['Embarked'].unique())

4

###- Indica cuánto es el total que se pagó sumando la tarifa de todos los pasajeros.

In [ ]:
df['Fare'].sum()

28693.9493

###- Crear un subconjunto de los datos de los que sobrevivieron y otro de los que no sobrevivieron.

In [ ]:
# Sobrevivientes
sur=df.loc[(df.Survived==1)]

In [ ]:
# No sobrevivientes
nosur=df.loc[(df.Survived==0)]

###- Mostrar los datos de 5 personas de las que sobrevivieron y de las que no sobrevivieron.

In [ ]:
# Sobrevivientes
sur.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
8            9         1       3  ...  11.1333   NaN         S
9           10         1       2  ...  30.0708   NaN         C

[5 rows x 12 columns]

In [ ]:
# No sobrevivientes
nosur.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
4            5         0       3  ...   8.0500   NaN         S
5            6         0       3  ...   8.4583   NaN         Q
6            7         0       1  ...  51.8625   E46         S
7            8         0       3  ...  21.0750   NaN         S

[5 rows x 12 columns]